# CSC 593

## Week 6

### Introduction to Pandas - File input/output

#### Setup

`cd uri_csc593`  
`git pull instructor master`

In [60]:
import numpy as np
import pandas as pd

#### Reading files

##### Basics

**CSV**

[`pd.read_csv()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html)

In [11]:
#load a csv.
nhis_person = pd.read_csv('../data/nhis/personsx.csv')
nhis_person.head()

,FPX,AGE_CHG,INTV_QRT,SEX,NOWAF,FSPOUS2,COHAB1,COHAB2,FCOHAB3,ASTATFLG,...,EDUC1,ERNYR_P,ARMFTM7P,ARMFTM1P,ARMFTM2P,ARMFTM3P,ARMFTM4P,ARMFTM5P,ARMFTM6P,ENGLANG
0,1,NaN,1,2,NaN,NaN,NaN,NaN,NaN,1.0,...,9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0
1,1,NaN,1,2,2.0,2.0,NaN,NaN,NaN,2.0,...,14,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0
2,2,NaN,1,1,2.0,1.0,NaN,NaN,NaN,0.0,...,15,7.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0
3,3,NaN,1,1,NaN,NaN,NaN,NaN,NaN,NaN,...,10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0
4,1,NaN,1,1,2.0,2.0,NaN,NaN,NaN,1.0,...,21,11.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1.0

**Excel**

[`pd.read_excel()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html)

In [62]:
#sheet_name is optional if you want the first (or only) sheet.
bookreq = pd.read_excel('../data/book_requests.xlsx', sheet_name=0)
bookreq.head()

,semester,year,total_book_requests,rock_book_requests,scili_book_requests,orwig_book_requests,hay_book_requests
0,Fall,2005,1207,786,115,306,0
1,Spring,2006,1490,941,133,416,0
2,Summer,2006,38,2,5,31,0
3,Fall,2006,1190,915,153,122,0
4,Spring,2007,1410,1086,114,206,4

The simple options only work for files that are formatted in a specific way: Headers on the first row, with data immediately under them. Pandas will try to guess the correct type for each column (integer, floating-point number, string, etc.)

**Fixed Width**

[`read_fwf()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_fwf.html)

In [54]:
icd = pd.read_fwf('../data/icd10cm_codes_2020.txt')
icd.head()

    A000 Cholera due to Vibrio cholerae 01, biovar cholerae
0   A001    Cholera due to Vibrio cholerae 01, biovar eltor
1   A009                               Cholera, unspecified
2  A0100                         Typhoid fever, unspecified
3  A0101                                 Typhoid meningitis
4  A0102               Typhoid fever with heart involvement

In [55]:
#Specify column names
icd = pd.read_fwf('../data/icd10cm_codes_2020.txt', 
                  names=['code', 'description'])
icd.head()

    code                                        description
0   A000  Cholera due to Vibrio cholerae 01, biovar chol...
1   A001    Cholera due to Vibrio cholerae 01, biovar eltor
2   A009                               Cholera, unspecified
3  A0100                         Typhoid fever, unspecified
4  A0101                                 Typhoid meningitis

In [56]:
#Specify column locations.
icd = pd.read_fwf('../data/icd10cm_codes_2020.txt', 
                  colspecs=((0,7),(8,72)), 
                  names=['code', 'description'])
icd.head()

    code                                        description
0   A000  Cholera due to Vibrio cholerae 01, biovar chol...
1   A001    Cholera due to Vibrio cholerae 01, biovar eltor
2   A009                               Cholera, unspecified
3  A0100                         Typhoid fever, unspecified
4  A0101                                 Typhoid meningitis

In [65]:
banner = pd.read_excel('../data/courselist.xlsx', sheet_name=0, nrows=1)

colnames = list(banner.columns)
print(colnames)
banner2 = pd.read_excel('../data/courselist.xlsx', sheet_name=0,
                    names=colnames, skiprows=range(10), nrows=10)
banner2

['CRN', 'Term', 'Description', 'Schedule', 'Schedule desc', 'Course title', 'Subject', 'Subject desc', 'Course number', 'Section', 'Text narrative', 'Max enrollment', 'Primary instructor first name', 'Primary instructor last name', 'Primary instructor email', 'Primary instructor Brown ID', 'Primary Instructor NetID', 'Course group']

,CRN,Term,Description,Schedule,Schedule desc,Course title,Subject,Subject desc,Course number,Section,Text narrative,Max enrollment,Primary instructor first name,Primary instructor last name,Primary instructor email,Primary instructor Brown ID,Primary Instructor NetID,Course group
0,10009,201910,2019-Fall,S,Primary Meeting,Clinical Nephrology,BIOL,Biology,3030,S24,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3030:2019-Fall:S24:
1,10010,201910,2019-Fall,S,Primary Meeting,Clinical Nephrology,BIOL,Biology,3035,S14,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3035:2019-Fall:S14:
2,10011,201910,2019-Fall,S,Primary Meeting,Clinical Dermatology,BIOL,Biology,3040,S12,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3040:2019-Fall:S12:
3,10012,201910,2019-Fall,S,Primary Meeting,Clinical Dermatology,BIOL,Biology,3040,S14,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3040:2019-Fall:S14:
4,10013,201910,2019-Fall,S,Primary Meeting,Clinical Dermatology,BIOL,Biology,3040,S21,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3040:2019-Fall:S21:
5,10014,201910,2019-Fall,S,Primary Meeting,Clinical Dermatology,BIOL,Biology,3040,S22,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3040:2019-Fall:S22:
6,10015,201910,2019-Fall,S,Primary Meeting,Clinical Dermatology,BIOL,Biology,3040,S24,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3040:2019-Fall:S24:
7,10016,201910,2019-Fall,S,Primary Meeting,Gastroenterology,BIOL,Biology,3050,S12,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3050:2019-Fall:S12:
8,10017,201910,2019-Fall,S,Primary Meeting,Gastroenterology,BIOL,Biology,3050,S14,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3050:2019-Fall:S14:
9,10018,201910,2019-Fall,S,Primary Meeting,Gastroenterology,BIOL,Biology,3050,S22,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3050:2019-Fall:S22:

##### Practice

Read your dataset from the `dataset` folder into a new DataFrame.

#### Joining 

[Merge, join, and concatenate](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)

##### Concatenating (merging top to bottom):

In [64]:
banner3 = pd.read_excel('../data/courselist.xlsx', sheet_name=0,
                    names=colnames, skiprows=range(100), nrows=10)

#ignore index means we re-number the rows.
classes = pd.concat([banner2, banner3], ignore_index=True)
classes

,CRN,Term,Description,Schedule,Schedule desc,Course title,Subject,Subject desc,Course number,Section,Text narrative,Max enrollment,Primary instructor first name,Primary instructor last name,Primary instructor email,Primary instructor Brown ID,Primary Instructor NetID,Course group
0,10009,201910,2019-Fall,S,Primary Meeting,Clinical Nephrology,BIOL,Biology,3030,S24,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3030:2019-Fall:S24:
1,10010,201910,2019-Fall,S,Primary Meeting,Clinical Nephrology,BIOL,Biology,3035,S14,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3035:2019-Fall:S14:
2,10011,201910,2019-Fall,S,Primary Meeting,Clinical Dermatology,BIOL,Biology,3040,S12,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3040:2019-Fall:S12:
3,10012,201910,2019-Fall,S,Primary Meeting,Clinical Dermatology,BIOL,Biology,3040,S14,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3040:2019-Fall:S14:
4,10013,201910,2019-Fall,S,Primary Meeting,Clinical Dermatology,BIOL,Biology,3040,S21,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3040:2019-Fall:S21:
5,10014,201910,2019-Fall,S,Primary Meeting,Clinical Dermatology,BIOL,Biology,3040,S22,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3040:2019-Fall:S22:
6,10015,201910,2019-Fall,S,Primary Meeting,Clinical Dermatology,BIOL,Biology,3040,S24,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3040:2019-Fall:S24:
7,10016,201910,2019-Fall,S,Primary Meeting,Gastroenterology,BIOL,Biology,3050,S12,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3050:2019-Fall:S12:
8,10017,201910,2019-Fall,S,Primary Meeting,Gastroenterology,BIOL,Biology,3050,S14,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3050:2019-Fall:S14:
9,10018,201910,2019-Fall,S,Primary Meeting,Gastroenterology,BIOL,Biology,3050,S22,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3050:2019-Fall:S22:
10,10099,201910,2019-Fall,S,Primary Meeting,Subinternship in Medicine,BIOL,Biology,3330,S10,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3330:2019-Fall:S10:
11,10100,201910,2019-Fall,S,Primary Meeting,Subinternship in Medicine,BIOL,Biology,3330,S14,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3330:2019-Fall:S14:
12,10101,201910,2019-Fall,S,Primary Meeting,Subinternship in Medicine,BIOL,Biology,3330,S24,No description available.,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3330:2019-Fall:S24:
13,10102,201910,2019-Fall,S,Primary Meeting,Subinternship in Medicine - MH,BIOL,Biology,3331,S14,NaN,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3331:2019-Fall:S14:
14,10103,201910,2019-Fall,S,Primary Meeting,Subinternship in Medicine - MH,BIOL,Biology,3331,S24,NaN,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3331:2019-Fall:S24:
15,10104,201910,2019-Fall,S,Primary Meeting,Subinternship in Medicine - MHRI,BIOL,Biology,3332,S14,NaN,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3332:2019-Fall:S14:
16,10105,201910,2019-Fall,S,Primary Meeting,Subinternship in Medicine - MHRI,BIOL,Biology,3332,S24,NaN,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3332:2019-Fall:S24:
17,10106,201910,2019-Fall,S,Primary Meeting,Subinternship in Medicine - RIH,BIOL,Biology,3333,S14,NaN,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3333:2019-Fall:S14:
18,10107,201910,2019-Fall,S,Primary Meeting,Subinternship in Medicine - RIH,BIOL,Biology,3333,S24,NaN,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3333:2019-Fall:S24:
19,10108,201910,2019-Fall,S,Primary Meeting,Subinternship in Medicine - VAMC,BIOL,Biology,3334,S14,NaN,999,NaN,NaN,NaN,NaN,NaN,COURSE:BIOL:3334:2019-Fall:S14:

##### Merging

In [18]:
nhis_family = pd.read_csv('../data/nhis/familyxx.csv')
nhis_family.head()

,FINT_Y_P,FINT_M_P,FMX,RECTYPE,SRVY_YR,HHX,FM_SIZE,FM_STRCP,FM_TYPE,FM_STRP,...,COVCONF,FHICOST,FMEDBILL,FMEDBPAY,FMEDBNOP,FSAF,FHICOVCT,FHICOVYN,FPRCOOH,FHIEBCCT
0,2018,1,1,60,2018,1,1,11,1,11,...,NaN,1,2,2,NaN,2,1,1,NaN,NaN
1,2018,1,1,60,2018,4,3,41,4,41,...,4.0,2,1,1,1.0,2,3,1,2.0,3.0
2,2018,2,1,60,2018,6,4,41,4,41,...,1.0,2,2,2,NaN,1,4,1,2.0,4.0
3,2018,3,1,60,2018,8,3,41,4,41,...,3.0,3,2,1,NaN,2,3,1,2.0,3.0
4,2018,2,1,60,2018,9,1,11,1,11,...,NaN,2,1,1,1.0,2,1,1,2.0,0.0

In [69]:
#Notes:  Use this variable [FMX] in combination with HHX and SRVY_YR 
#to identify individual families. 
nhis = pd.merge(nhis_person, nhis_family, on=['FMX', 'HHX', 'SRVY_YR'])
nhis.head()

,FPX,AGE_CHG,INTV_QRT,SEX,NOWAF,FSPOUS2,COHAB1,COHAB2,FCOHAB3,ASTATFLG,...,COVCONF,FHICOST,FMEDBILL,FMEDBPAY,FMEDBNOP,FSAF,FHICOVCT,FHICOVYN,FPRCOOH,FHIEBCCT
0,1,NaN,1,2,NaN,NaN,NaN,NaN,NaN,1.0,...,NaN,1,2,2,NaN,2,1,1,NaN,NaN
1,1,NaN,1,2,2.0,2.0,NaN,NaN,NaN,2.0,...,4.0,2,1,1,1.0,2,3,1,2.0,3.0
2,2,NaN,1,1,2.0,1.0,NaN,NaN,NaN,0.0,...,4.0,2,1,1,1.0,2,3,1,2.0,3.0
3,3,NaN,1,1,NaN,NaN,NaN,NaN,NaN,NaN,...,4.0,2,1,1,1.0,2,3,1,2.0,3.0
4,1,NaN,1,1,2.0,2.0,NaN,NaN,NaN,1.0,...,1.0,2,2,2,NaN,1,4,1,2.0,4.0

In [66]:
nhis = pd.merge(nhis_person, nhis_family, 
                right_on=['FMX', 'HHX', 'SRVY_YR'],
                left_on=['FMX', 'HHX', 'SRVY_YR'])
nhis.head()

,FPX,AGE_CHG,INTV_QRT,SEX,NOWAF,FSPOUS2,COHAB1,COHAB2,FCOHAB3,ASTATFLG,...,COVCONF,FHICOST,FMEDBILL,FMEDBPAY,FMEDBNOP,FSAF,FHICOVCT,FHICOVYN,FPRCOOH,FHIEBCCT
0,1,NaN,1,2,NaN,NaN,NaN,NaN,NaN,1.0,...,NaN,1,2,2,NaN,2,1,1,NaN,NaN
1,1,NaN,1,2,2.0,2.0,NaN,NaN,NaN,2.0,...,4.0,2,1,1,1.0,2,3,1,2.0,3.0
2,2,NaN,1,1,2.0,1.0,NaN,NaN,NaN,0.0,...,4.0,2,1,1,1.0,2,3,1,2.0,3.0
3,3,NaN,1,1,NaN,NaN,NaN,NaN,NaN,NaN,...,4.0,2,1,1,1.0,2,3,1,2.0,3.0
4,1,NaN,1,1,2.0,2.0,NaN,NaN,NaN,1.0,...,1.0,2,2,2,NaN,1,4,1,2.0,4.0

In [70]:
nhis_households = pd.read_csv('../data/nhis/househld.csv')

#### Summarizing

In [20]:
nhis.head()

,FPX,AGE_CHG,INTV_QRT,SEX,NOWAF,FSPOUS2,COHAB1,COHAB2,FCOHAB3,ASTATFLG,...,COVCONF,FHICOST,FMEDBILL,FMEDBPAY,FMEDBNOP,FSAF,FHICOVCT,FHICOVYN,FPRCOOH,FHIEBCCT
0,1,NaN,1,2,NaN,NaN,NaN,NaN,NaN,1.0,...,NaN,1,2,2,NaN,2,1,1,NaN,NaN
1,1,NaN,1,2,2.0,2.0,NaN,NaN,NaN,2.0,...,4.0,2,1,1,1.0,2,3,1,2.0,3.0
2,2,NaN,1,1,2.0,1.0,NaN,NaN,NaN,0.0,...,4.0,2,1,1,1.0,2,3,1,2.0,3.0
3,3,NaN,1,1,NaN,NaN,NaN,NaN,NaN,NaN,...,4.0,2,1,1,1.0,2,3,1,2.0,3.0
4,1,NaN,1,1,2.0,2.0,NaN,NaN,NaN,1.0,...,1.0,2,2,2,NaN,1,4,1,2.0,4.0

In [21]:
nhis.head(1)

,FPX,AGE_CHG,INTV_QRT,SEX,NOWAF,FSPOUS2,COHAB1,COHAB2,FCOHAB3,ASTATFLG,...,COVCONF,FHICOST,FMEDBILL,FMEDBPAY,FMEDBNOP,FSAF,FHICOVCT,FHICOVYN,FPRCOOH,FHIEBCCT
0,1,NaN,1,2,NaN,NaN,NaN,NaN,NaN,1.0,...,NaN,1,2,2,NaN,2,1,1,NaN,NaN

In [22]:
nhis.tail(3)

,FPX,AGE_CHG,INTV_QRT,SEX,NOWAF,FSPOUS2,COHAB1,COHAB2,FCOHAB3,ASTATFLG,...,COVCONF,FHICOST,FMEDBILL,FMEDBPAY,FMEDBNOP,FSAF,FHICOVCT,FHICOVYN,FPRCOOH,FHIEBCCT
72828,1,NaN,4,2,2.0,2.0,NaN,NaN,NaN,1.0,...,2.0,2,2,2,NaN,2,2,1,2.0,2.0
72829,2,NaN,4,1,NaN,1.0,NaN,NaN,NaN,2.0,...,2.0,2,2,2,NaN,2,2,1,2.0,2.0
72830,1,NaN,4,2,NaN,NaN,NaN,NaN,NaN,1.0,...,NaN,1,2,2,NaN,2,1,1,2.0,0.0

In [23]:
nhis.describe()

,FPX,AGE_CHG,INTV_QRT,SEX,NOWAF,FSPOUS2,COHAB1,COHAB2,FCOHAB3,ASTATFLG,...,COVCONF,FHICOST,FMEDBILL,FMEDBPAY,FMEDBNOP,FSAF,FHICOVCT,FHICOVYN,FPRCOOH,FHIEBCCT
count,72831.000000,0.0,72831.000000,72831.000000,43253.000000,30354.000000,4082.000000,1541.000000,4082.000000,56166.000000,...,44055.000000,72831.000000,72831.000000,72831.000000,10357.000000,72831.000000,72831.000000,72831.000000,49263.000000,52241.000000
mean,2.138334,NaN,2.352542,1.511897,1.994567,1.576596,1.673689,2.911097,1.651886,1.382990,...,2.828101,2.158271,1.878829,1.802543,1.617071,1.948758,2.916011,1.056858,1.926395,2.335120
std,1.338204,NaN,1.035801,0.499862,0.096853,0.662259,0.776296,0.698245,0.868227,0.661738,...,1.309343,1.773005,0.489456,0.670369,1.094391,0.895844,1.694995,0.404043,0.391930,1.718593
min,1.000000,NaN,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,0.000000,...,1.000000,0.000000,1.000000,1.000000,1.000000,1.000000,0.000000,1.000000,1.000000,0.000000
25%,1.000000,NaN,1.000000,1.000000,2.000000,1.000000,1.000000,3.000000,1.000000,1.000000,...,2.000000,1.000000,2.000000,2.000000,1.000000,2.000000,2.000000,1.000000,2.000000,1.000000
50%,2.000000,NaN,2.000000,2.000000,2.000000,2.000000,2.000000,3.000000,2.000000,1.000000,...,3.000000,2.000000,2.000000,2.000000,1.000000,2.000000,3.000000,1.000000,2.000000,2.000000
75%,3.000000,NaN,3.000000,2.000000,2.000000,2.000000,2.000000,3.000000,2.000000,2.000000,...,4.000000,3.000000,2.000000,2.000000,2.000000,2.000000,4.000000,1.000000,2.000000,4.000000
max,13.000000,NaN,4.000000,2.000000,9.000000,10.000000,9.000000,9.000000,11.000000,4.000000,...,9.000000,9.000000,9.000000,9.000000,9.000000,9.000000,12.000000,9.000000,9.000000,10.000000

In [71]:
nhis.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 72831 entries, 0 to 72830
Columns: 726 entries, FPX to FHIEBCCT
dtypes: float64(539), int64(184), object(3)
memory usage: 404.0+ MB

In [72]:
nhis.median().head()

FPX         2.0
AGE_CHG     NaN
INTV_QRT    2.0
SEX         2.0
NOWAF       2.0
dtype: float64

In [25]:
bookreq.quantile(.5)

year                   2014.0
total_book_requests     200.5
rock_book_requests       48.0
scili_book_requests       8.5
orwig_book_requests      34.0
hay_book_requests         0.0
Name: 0.5, dtype: float64

In [26]:
bookreq.quantile([.25, .5, .75])

,year,total_book_requests,rock_book_requests,scili_book_requests,orwig_book_requests,hay_book_requests
0.25,2010.0,27.25,19.75,0.00,0.0,0.0
0.50,2014.0,200.50,48.00,8.50,34.0,0.0
0.75,2017.0,1199.50,921.50,78.75,182.0,0.0

In [27]:
bookreq.mean()

year                   2013.383333
total_book_requests     619.416667
rock_book_requests      483.666667
scili_book_requests      39.150000
orwig_book_requests      95.766667
hay_book_requests         0.833333
dtype: float64

#### Cleaning

We can search the entire dataframe for a value.

In [28]:
banner.astype(np.object)  == 'BIOL'

,CRN,Term,Description,Schedule,Schedule desc,Course title,Subject,Subject desc,Course number,Section,Text narrative,Max enrollment,Primary instructor first name,Primary instructor last name,Primary instructor email,Primary instructor Brown ID,Primary Instructor NetID,Course group
0,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,True,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,True,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,True,False,False,False,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,True,False,False,False,False,False,False,False,False,False,False,False
6,False,False,False,False,False,False,True,False,False,False,False,False,False,False,False,False,False,False
7,False,False,False,False,False,False,True,False,False,False,False,False,False,False,False,False,False,False
8,False,False,False,False,False,False,True,False,False,False,False,False,False,False,False,False,False,False
9,False,False,False,False,False,False,True,False,False,False,False,False,False,False,False,False,False,False

 The `any()` method will tell us which columns contain a value:

In [29]:
(banner.astype(np.object)  == 'BIOL').any()

CRN                              False
Term                             False
Description                      False
Schedule                         False
Schedule desc                    False
Course title                     False
Subject                           True
Subject desc                     False
Course number                    False
Section                          False
Text narrative                   False
Max enrollment                   False
Primary instructor first name    False
Primary instructor last name     False
Primary instructor email         False
Primary instructor Brown ID      False
Primary Instructor NetID         False
Course group                     False
dtype: bool

The above methods don't work with `NaN` (missing values) because `NaN` doesn't equal itself:

In [30]:
np.nan == np.nan

False

We have to use the `isnull()` method to find `NaN`.

In [31]:
#Are there missing values?
pd.isnull(banner).any()

CRN                              False
Term                             False
Description                      False
Schedule                         False
Schedule desc                    False
Course title                     False
Subject                          False
Subject desc                     False
Course number                    False
Section                          False
Text narrative                    True
Max enrollment                   False
Primary instructor first name     True
Primary instructor last name      True
Primary instructor email          True
Primary instructor Brown ID       True
Primary Instructor NetID          True
Course group                     False
dtype: bool

In [73]:
#staging
NA = np.nan
data = [[10, 11, NA, 8],[5,4,5,8],[9,9,3,4], [NA, NA, NA, NA], [NA, 4, 5, 9]]
dr = pd.DataFrame(data)
dr

      0     1    2    3
0  10.0  11.0  NaN  8.0
1   5.0   4.0  5.0  8.0
2   9.0   9.0  3.0  4.0
3   NaN   NaN  NaN  NaN
4   NaN   4.0  5.0  9.0

Pandas provides a couple of built-in methods for dealing with missing values. `dropna()` will remove them, along with the entire row they belong in.

In [33]:
dr.dropna()

     0    1    2    3
1  5.0  4.0  5.0  8.0
2  9.0  9.0  3.0  4.0

In [34]:
#Drop the columns instead.
dr.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [35]:
#Only remove rows where all values are `NaN`.
dr.dropna(how='all')

      0     1    2    3
0  10.0  11.0  NaN  8.0
1   5.0   4.0  5.0  8.0
2   9.0   9.0  3.0  4.0
4   NaN   4.0  5.0  9.0

You can also fill in missing values using the `fillna()` function:

In [36]:
#replace them all with zeroes.
dr.fillna(0)

      0     1    2    3
0  10.0  11.0  0.0  8.0
1   5.0   4.0  5.0  8.0
2   9.0   9.0  3.0  4.0
3   0.0   0.0  0.0  0.0
4   0.0   4.0  5.0  9.0

In [37]:
#Use a dictionary to set different values per-column.
dr.fillna({0: 10, 2: 5})

      0     1    2    3
0  10.0  11.0  5.0  8.0
1   5.0   4.0  5.0  8.0
2   9.0   9.0  3.0  4.0
3  10.0   NaN  5.0  NaN
4  10.0   4.0  5.0  9.0

In [38]:
#Make changes in place:
dr.fillna({0: 10, 2: 5}, inplace=True)
dr

      0     1    2    3
0  10.0  11.0  5.0  8.0
1   5.0   4.0  5.0  8.0
2   9.0   9.0  3.0  4.0
3  10.0   NaN  5.0  NaN
4  10.0   4.0  5.0  9.0

In [39]:
#staging.
dr.iloc[2:,1] = NA
dr

      0     1    2    3
0  10.0  11.0  5.0  8.0
1   5.0   4.0  5.0  8.0
2   9.0   NaN  3.0  4.0
3  10.0   NaN  5.0  NaN
4  10.0   NaN  5.0  9.0

In [40]:
#Fill forward
dr.fillna(method='ffill')

      0     1    2    3
0  10.0  11.0  5.0  8.0
1   5.0   4.0  5.0  8.0
2   9.0   4.0  3.0  4.0
3  10.0   4.0  5.0  4.0
4  10.0   4.0  5.0  9.0

In [41]:
#Backwards
dr.fillna(method='bfill')

      0     1    2    3
0  10.0  11.0  5.0  8.0
1   5.0   4.0  5.0  8.0
2   9.0   NaN  3.0  4.0
3  10.0   NaN  5.0  9.0
4  10.0   NaN  5.0  9.0

In [42]:
#Limit how many rows forward.
dr.fillna(method='ffill', limit=2)

      0     1    2    3
0  10.0  11.0  5.0  8.0
1   5.0   4.0  5.0  8.0
2   9.0   4.0  3.0  4.0
3  10.0   4.0  5.0  4.0
4  10.0   NaN  5.0  9.0

You can also use functions to provide the values.

In [43]:
#Fill with the mean.
dr.fillna(dr.mean())

      0     1    2     3
0  10.0  11.0  5.0  8.00
1   5.0   4.0  5.0  8.00
2   9.0   7.5  3.0  4.00
3  10.0   7.5  5.0  7.25
4  10.0   7.5  5.0  9.00

In [44]:
dr.fillna(dr.median())

      0     1    2    3
0  10.0  11.0  5.0  8.0
1   5.0   4.0  5.0  8.0
2   9.0   7.5  3.0  4.0
3  10.0   7.5  5.0  8.0
4  10.0   7.5  5.0  9.0

In [45]:
np.mean(pd.DataFrame([dr[2].shift(1), dr[2].shift(-1)]))

0    5.0
1    4.0
2    5.0
3    4.0
4    5.0
dtype: float64

#### Find and remove duplicates

In [46]:
#staging
dr2 = pd.DataFrame(data + [[5,4,5,8]])
dr2

      0     1    2    3
0  10.0  11.0  NaN  8.0
1   5.0   4.0  5.0  8.0
2   9.0   9.0  3.0  4.0
3   NaN   NaN  NaN  NaN
4   NaN   4.0  5.0  9.0
5   5.0   4.0  5.0  8.0

In [86]:
#The last row is a duplicate
dr2.duplicated()
dr2.iloc[:,[1,0,3]]
dr2.loc[:,]
#environ_data.iloc[:,].head()

      1     0    3
0  11.0  10.0  8.0
1   4.0   5.0  8.0
2   9.0   9.0  4.0
3   NaN   NaN  NaN
4   4.0   NaN  9.0
5   4.0   5.0  8.0

In [48]:
dr2.drop_duplicates()

      0     1    2    3
0  10.0  11.0  NaN  8.0
1   5.0   4.0  5.0  8.0
2   9.0   9.0  3.0  4.0
3   NaN   NaN  NaN  NaN
4   NaN   4.0  5.0  9.0

In [49]:
#Keep the last one instead
dr2.drop_duplicates(keep='last')

      0     1    2    3
0  10.0  11.0  NaN  8.0
2   9.0   9.0  3.0  4.0
3   NaN   NaN  NaN  NaN
4   NaN   4.0  5.0  9.0
5   5.0   4.0  5.0  8.0

In [50]:
#Based only on some columns.
dr2.drop_duplicates([1,2])

      0     1    2    3
0  10.0  11.0  NaN  8.0
1   5.0   4.0  5.0  8.0
2   9.0   9.0  3.0  4.0
3   NaN   NaN  NaN  NaN

#### [Replace values](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.replace.html)

In [51]:
df = pd.DataFrame({'A': ['bat', 'foo', 'bait'],
                    'B': ['abc', 'bar', 'xyz']})
df

      A    B
0   bat  abc
1   foo  bar
2  bait  xyz

In [52]:
df.replace(to_replace=r'^ba.$', value='new', regex=True)

      A    B
0   new  abc
1   foo  new
2  bait  xyz

#### Writing files

In [53]:
icd.to_csv('../dataset/icd.csv')

##### Practice

Write your currently-loaded dataset to a new file in your `../dataset` folder.